# Optional Exercise - Data loading

Heres a very short example for four files to load in. None of these example should be hard, but the idea is to familiarise yourself with the sorts of error messages or weird output you'd get if you load in with the defaults (and they don't work), and then how to change your input arguments to make it better.

The files to attempt to load in are:

1. example.pkl
2. example_1.csv
3. example_2.csv
3. example_3.csv
3. example_4.csv

In [1]:
import pandas as pd
import numpy as np

In [2]:
# Load example.pkl
pk_file = pd.read_pickle('example.pkl')
pk_file

      name  gender   age  oaths
0  Kaladin    Male  20.0    3.0
1  Shallan  Female  17.0    2.0
2  Dalinar    Male  53.0    3.0
3    Szeth    Male  35.0    0.0
4     Hoid    Male   NaN    NaN
5  Jashnah  Female  34.0    3.0

In [3]:
# Load example_1.csv
file_1 = pd.read_csv('example_1.csv')
file_1

      name  gender   age  oaths
0  Kaladin    Male  20.0    3.0
1  Shallan  Female  17.0    2.0
2  Dalinar    Male  53.0    3.0
3    Szeth    Male  35.0    0.0
4     Hoid    Male   NaN    NaN
5  Jashnah  Female  34.0    3.0

In [5]:
# Load example_2.csv
file_2 = pd.read_csv('example_2.csv', delimiter='\t')
file_2

      name  gender   age  oaths
0  Kaladin    Male  20.0    3.0
1  Shallan  Female  17.0    2.0
2  Dalinar    Male  53.0    3.0
3    Szeth    Male  35.0    0.0
4     Hoid    Male   NaN    NaN
5  Jashnah  Female  34.0    3.0

In [21]:
# Load example_3.csv
file_3 = pd.read_csv('example_3.csv')
file_3.drop('Unnamed: 0', axis=1, inplace=True)
file_3

      name  gender   age  oaths
0  Kaladin    Male  20.0    3.0
1  Shallan  Female  17.0    2.0
2  Dalinar    Male  53.0    3.0
3    Szeth    Male  35.0    0.0
4     Hoid    Male   NaN    NaN
5  Jashnah  Female  34.0    3.0

In [23]:
# Load example_4.csv
file_4 = pd.read_csv('example_4.csv', delimiter='|', comment="#")
file_4

      name  gender   age  oaths
0  Kaladin    Male  20.0    3.0
1  Shallan  Female  17.0    2.0
2  Dalinar    Male  53.0    3.0
3    Szeth    Male  35.0    0.0
4     Hoid    Male   NaN    NaN
5  Jashnah  Female  34.0    3.0

### Completed at: 13/03/2023